In [8]:
import pandas as pd

In [9]:
#1)create a dataframe

df=pd.DataFrame({"id":[1,2,3,4,5,6],"name":["zeeshan","amit","salman",
                    "ramya","neha","sai"],"age":[22,21,25,20,19,20]})

In [10]:
df.head(5)

   id     name  age
0   1  zeeshan   22
1   2     amit   21
2   3   salman   25
3   4    ramya   20
4   5     neha   19

In [11]:
# 2) add a new column to existing dataframe

df["salary"]=[12000,21000,15000,14000,25000,24000]
df.head()

   id     name  age  salary
0   1  zeeshan   22   12000
1   2     amit   21   21000
2   3   salman   25   15000
3   4    ramya   20   14000
4   5     neha   19   25000

In [12]:
# 3)convert dictionary into dataframe
a={"id":[1,2,3,4,5],"name":["zeeshan","salman","amit","akhil","ramya"]}
df1=pd.DataFrame(a)
df1

   id     name
0   1  zeeshan
1   2   salman
2   3     amit
3   4    akhil
4   5    ramya

In [14]:
# 4)add a new column at specified position
df1.insert(1,"email",["zeeshan@gmail.com","abc@gmail.com","amit@gmail.com","ram@gmail.com","king@gmail.com"],True)  
   # at index position 1 it will add value

In [15]:
df1

   id              email     name
0   1  zeeshan@gmail.com  zeeshan
1   2      abc@gmail.com   salman
2   3     amit@gmail.com     amit
3   4      ram@gmail.com    akhil
4   5     king@gmail.com    ramya

In [17]:
#
# 5) how to assign a new column in dataframe using assign method

df2=df1.assign(salary=[12000,15000,16000,19000,20000])

In [18]:
df2

   id              email     name  salary
0   1  zeeshan@gmail.com  zeeshan   12000
1   2      abc@gmail.com   salman   15000
2   3     amit@gmail.com     amit   16000
3   4      ram@gmail.com    akhil   19000
4   5     king@gmail.com    ramya   20000

In [19]:
 
#6) how can we print the data of dataframe using for loop?

df3=pd.DataFrame({"class":["A","B","C","D"],"no of students ":[40,34,46,50],"no of subjects":[4,5,7,5]})
df3

  class  no of students   no of subjects
0     A               40               4
1     B               34               5
2     C               46               7
3     D               50               5

In [26]:
for i,j in df3.iterrows():          # result will be in terms of row wise
  print(i,j)            # i= rows , j= columns
  print()              ## for space

0 class               A
no of students     40
no of subjects      4
Name: 0, dtype: object

1 class               B
no of students     34
no of subjects      5
Name: 1, dtype: object

2 class               C
no of students     46
no of subjects      7
Name: 2, dtype: object

3 class               D
no of students     50
no of subjects      5
Name: 3, dtype: object

In [27]:
# 7) how can we retreive the data of a dataframe using iteritems() methods
df4=pd.DataFrame({"section":[1,2,4,5],"no of books":[124,125,241,250],"year of published":[1994,2000,2001,2010]})
df4.head()

   section  no of books  year of published
0        1          124               1994
1        2          125               2000
2        4          241               2001
3        5          250               2010

In [29]:
for i,j in df4.iteritems():      # result will be in column wise
  print(i,j)

section 0    1
1    2
2    4
3    5
Name: section, dtype: int64
no of books 0    124
1    125
2    241
3    250
Name: no of books, dtype: int64
year of published 0    1994
1    2000
2    2001
3    2010
Name: year of published, dtype: int64

In [35]:
#8) how can we retreive the data in dataframe in terms of tuples:

df5=pd.DataFrame({"brand":["hp","asus","lenovo","apple"],"cost":["30k","45k","40k","55k"],"country_of_manufacturer":["germany","china","japan","america"]})
for i in df5.itertuples():
  print(i)
  print()

Pandas(Index=0, brand='hp', cost='30k', country_of_manufacturer='germany')

Pandas(Index=1, brand='asus', cost='45k', country_of_manufacturer='china')

Pandas(Index=2, brand='lenovo', cost='40k', country_of_manufacturer='japan')

Pandas(Index=3, brand='apple', cost='55k', country_of_manufacturer='america')

In [51]:
# 9) how to sort the dataframe
df6=pd.DataFrame({"id":[21,22,23,24],"organisation":["oracle","tcs","ibm"," "],
                  "no_of_employees":[3000,4000,5000,6000]})
df6

   id organisation  no_of_employees
0  21       oracle             3000
1  22          tcs             4000
2  23          ibm             5000
3  24                          6000

In [81]:
df6.sort_values("no_of_employees",axis=0,ascending=True,inplace=True,na_position="last")

In [82]:
df6

   id organisation  no_of_employees
0  21       oracle             3000
1  22          tcs             4000
2  23          ibm             5000
3  24                          6000

In [75]:
df6.sort_values("id",axis=0,ascending=True,inplace=True,na_position="last")

In [76]:
df6

   id organisation  no_of_employees
0  21       oracle             3000
1  22          tcs             4000
2  23          ibm             5000
3  24                          6000

In [85]:
# 10) how can we sort more than one columns :
df6.sort_values(["id","no_of_employees","organisation"],axis=0,ascending=[False,True,False],inplace=True,na_position="last")
df6

   id organisation  no_of_employees
3  24                          6000
2  23          ibm             5000
1  22          tcs             4000
0  21       oracle             3000

In [90]:


#11) create a dataframe with columns , name , id, salary, dept , 
  # location . and take duplicates for same dept, salary, location

df7=pd.DataFrame({"id":[201,202,203,204,205,206,207,208,209,210],
                   "name":["amit","zeeshan","teju","madh","rohit","manoj","salman","vikash","sai","pooja"],
                    "salary":["20k","25k","30k","22k","20k","25k","30k","40k","21k","20k"],
                   "dept":["it","r&d","quality","quality","it","r&d","production","testing","testing","quality"],
                   "location":["pune","hyderabad","hyderabad","bangalore","mysore","chennai","pune","bangalore","odisha","delhi"]})
df7

    id     name salary        dept   location
0  201     amit    20k          it       pune
1  202  zeeshan    25k         r&d  hyderabad
2  203     teju    30k     quality  hyderabad
3  204     madh    22k     quality  bangalore
4  205    rohit    20k          it     mysore
5  206    manoj    25k         r&d    chennai
6  207   salman    30k  production       pune
7  208   vikash    40k     testing  bangalore
8  209      sai    21k     testing     odisha
9  210    pooja    20k     quality      delhi

In [91]:
# a) how to make groups in the dataframe
df7.groupby("dept")
print(df7.groupby("dept").groups)

{'it': [0, 4], 'production': [6], 'quality': [2, 3, 9], 'r&d': [1, 5], 'testing': [7, 8]}

In [92]:
df7.groupby("location")
print(df7.groupby("location").groups)

{'bangalore': [3, 7], 'chennai': [5], 'delhi': [9], 'hyderabad': [1, 2], 'mysore': [4], 'odisha': [8], 'pune': [0, 6]}

In [95]:
df7.head(10)

    id     name salary        dept   location
0  201     amit    20k          it       pune
1  202  zeeshan    25k         r&d  hyderabad
2  203     teju    30k     quality  hyderabad
3  204     madh    22k     quality  bangalore
4  205    rohit    20k          it     mysore
5  206    manoj    25k         r&d    chennai
6  207   salman    30k  production       pune
7  208   vikash    40k     testing  bangalore
8  209      sai    21k     testing     odisha
9  210    pooja    20k     quality      delhi

In [96]:
df7.groupby(["dept","salary"])
print(df7.groupby(["dept","salary"]).groups)

{('it', '20k'): [0, 4], ('production', '30k'): [6], ('quality', '20k'): [9], ('quality', '22k'): [3], ('quality', '30k'): [2], ('r&d', '25k'): [1, 5], ('testing', '21k'): [8], ('testing', '40k'): [7]}